{
  "updates": [
    {
      "month": "February",
      "year": 2026,
      "date": "2026-02-08",
      "items": [
        {
          "title": "Clickable IP Links in Repeater Details",
          "description": "AllStar and EchoLink nodes in the repeater detail modal are now clickable. AllStar links open the AllStar Stats page, and EchoLink links open the RepeaterBook node status page."
        },
        {
          "title": "Enhanced Repeater Detail Modal",
          "description": "Improved repeater detail modal with visual indicators for clickable IP links, including external link icons and hover effects for better user experience."
        }
      ]
    },
    {
      "month": "January",
      "year": 2026,
      "date": "2026-01-02",
      "items": [
        {
          "title": "Code Reorganization & Optimization",
          "description": "Eliminated ~450 lines of duplicate code through centralized configuration (config.js), shared utilities (utils.js), and modular architecture. Organized JavaScript and data files into logical directories."
        },
        {
          "title": "Enhanced Spotter Activation System",
          "description": "Implemented three-level urgency system (standard/enhanced/PDS) with automatic detection from NWS Hazardous Weather Outlook. Visual indicators help spotters quickly assess activation status."
        },
        {
          "title": "Improved Error Handling",
          "description": "Added defensive error handling, cache diagnostics, and robust fallbacks for configuration loading and API calls. Better reliability during severe weather events."
        },
        {
          "title": "Unified Dashboard",
          "description": "Consolidated alerts into comprehensive spotter dashboard with HWO, activation status, all active alerts, and quick access to 6 essential weather maps."
        }
      ]
    },
    {
      "month": "December",
      "year": 2025,
      "date": "2025-12-30",
      "items": [
        {
          "title": "Component Architecture",
          "description": "Implemented dynamic header and footer components with integrated theme toggle and navigation system for easier maintenance across all pages."
        },
        {
          "title": "Sticky Navigation",
          "description": "Page navigation now remains visible while scrolling with glassmorphism effects for easier access to page sections during severe weather events."
        },
        {
          "title": "Unified Button Design",
          "description": "Consistent styling across all interactive elements with enhanced hover effects, smooth transitions, and improved accessibility."
        }
      ]
    },
    {
      "month": "November",
      "year": 2025,
      "date": "2025-11-09",
      "items": [
        {
          "title": "Complete CSS Refactor",
          "description": "Mobile-first redesign with CSS Grid and Flexbox layouts, improved accessibility with ARIA attributes, and semantic HTML5 structure."
        },
        {
          "title": "Dark Mode Support",
          "description": "Automatic light/dark mode based on system preferences with custom theme toggle button and smooth transitions between themes."
        },
        {
          "title": "Enhanced Mobile Navigation",
          "description": "Improved mobile hamburger menu with better touch targets, accessibility features, and dual navigation system (site-wide and page-specific)."
        }
      ]
    }
  ]
}
